iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
/**
 * @author      iota square [i2]
 * <pre>
 * ██╗ ██████╗ ████████╗ █████╗ ██████╗
 * ██║██╔═══██╗╚══██╔══╝██╔══██╗╚════██╗
 * ██║██║   ██║   ██║   ███████║ █████╔╝
 * ██║██║   ██║   ██║   ██╔══██║██╔═══╝
 * ██║╚██████╔╝   ██║   ██║  ██║███████╗
 * ╚═╝ ╚═════╝    ╚═╝   ╚═╝  ╚═╝╚══════╝
 * </pre>
 *
 * @date        16-09-2019
 * @file        i2_stm32f4xx_hal_uart.c
 * @brief       UART set-up and control.
 *
 * @copyright   GNU GPU v3
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 3
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * Free Software, Hell Yeah!
 *
 **/

/* Includes ------------------------------------------------------------------*/
#include "i2_stm32f4xx_hal_uart.h"
#include "i2_stm32f4xx_hal_gpio.h"
#include "i2_stm32f4xx_hal_common.h"

#include "stm32f4xx_hal_conf.h"
#include "stm32f4xx_hal_dma.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_gpio_ex.h"

#if defined ( ENABLE_RTOS_AWARE_HAL )
#include <FreeRTOS.h>
#include <semphr.h>
#endif /* ENABLE_RTOS_AWARE_HAL */

/* Private defines -----------------------------------------------------------*/
/* Definition for UART Priority */
#define UART_PREEMPTION_PRIORITY      ( 5 ) /**< UART Preemption priority     */
#define UART_SUB_PRIORITY             ( 1 ) /**< UART Sub priority            */
#define UART_DMA_PREEMPTION_PRIORITY  ( 5 ) /**< UART DMA Preemption priority */
#define UART_DMA_SUB_PRIORITY         ( 1 ) /**< UART DMA Sub priority        */

/**
 * @defgroup I2_UART_CONFIG UART configurations.
 * Defines available configurations for UART peripheral including GPIO and DMA.
 *
 * @{
 *
 *  | UART    | PIN   | GPIO    | AF  | DMA   | CHANNEL   | STREAM    |
 *  |:-------:|:-----:|:-------:|:---:|:-----:|:---------:|:---------:|
 *  | USART1  | RX    | PA10    | AF7 | DMA2  | CHANNEL4  | STREAM2   |
 *  | ^       | ^     | PB7     | ^   | ^     | ^         | STREAM5   |
 *  | ^       | TX    | PA9     | ^   | ^     | ^         | STREAM7   |
 *  | ^       | ^     | PB9     | ^   | ^     | ^         | ^         |
 *  | USART2  | RX    | PA3     | AF7 | DMA1  | CHANNEL4  | STREAM5   |
 *  | ^       | ^     | PD6     | ^   | ^     | ^         | ^         |
 *  | ^       | TX    | PA2     | ^   | ^     | ^         | STREAM6   |
 *  | ^       | ^     | PD5     | ^   | ^     | ^         | ^         |
 *  | USART3  | RX    | PB11    | AF7 | DMA1  | CHANNEL4  | STREAM1   |
 *  | ^       | ^     | PC11    | ^   | ^     | ^         | ^         |
 *  | ^       | ^     | PD9     | ^   | ^     | ^         | ^         |
 *  | ^       | TX    | PB10    | ^   | ^     | ^         | STREAM3   |
 *  | ^       | ^     | PC10    | ^   | ^     | ^         | ^         |
 *  | ^       | ^     | PD8     | ^   | ^     | ^         | ^         |
 *  | UART4   | RX    | PA1     | AF8 | DMA1  | CHANNEL4  | STREAM2   |
 *  | ^       | ^     | PC11    | ^   | ^     | ^         | ^         |
 *  | ^       | TX    | PA0     | ^   | ^     | ^         | STREAM4   |
 *  | ^       | ^     | PC10    | ^   | ^     | ^         | ^         |
 *  | UART5   | RX    | PC12    | AF8 | DMA1  | CHANNEL4  | STREAM0   |
 *  | ^       | TX    | PA0     | ^   | ^     | ^         | STREAM7   |
 *  | USART6  | RX    | PC7     | AF8 | DMA2  | CHANNEL5  | STREAM1   |
 *  | ^       | ^     | PG9     | ^   | ^     | ^         | STREAM2   |
 *  | ^       | TX    | PC6     | ^   | ^     | ^         | STREAM6   |
 *  | ^       | ^     | PG14    | ^   | ^     | ^         | STREAM7   |
 *
 */
/** @} */ /* I2_UART_CONFIG */

/* Defined Number of UART Modules to Enable ***********************************/
/**
 * @defgroup I2_ENABLE_UART_CONTEXT UART peripheral enabling.
 * Enables any number of UART context among all available UART  modules.
 *
 * @{
 */
#define I2_MAX_NUM_UART_CONTEXT   ( 6 ) /**< Count of UART contexts to enable */
#define I2_ENABLE_UART1_CONTEXT         /**< Define to enable UART1 Context   */
#define I2_ENABLE_UART2_CONTEXT         /**< Define to enable UART2 Context   */
#define I2_ENABLE_UART3_CONTEXT         /**< Define to enable UART3 Context   */
#define I2_ENABLE_UART4_CONTEXT         /**< Define to enable UART4 Context   */
#define I2_ENABLE_UART5_CONTEXT         /**< Define to enable UART5 Context   */
#define I2_ENABLE_UART6_CONTEXT         /**< Define to enable UART6 Context   */
/** @} */ /* I2_ENABLE_UART_CONTEXT */

/* UART1 CONFIGURATION SELECTION **********************************************/
#if defined ( I2_ENABLE_UART1_CONTEXT )
/**
 * @defgroup I2_UART1_CONFIG UART1 configurations.
 * Configuration settings for UART1.
 *
 * @{
 */
/**
 * @defgroup I2_UART1_GPIO UART1 pin configurations.
 * Definition for UART1 Pins, to be defined as < PORT, PIN >.
 *
 * @{
 */
#define UART1_RX_GPIO_CONFIG      GPIOA, GPIO_PIN_9   /**< UART1 RX Pin       */
#define UART1_TX_GPIO_CONFIG      GPIOA, GPIO_PIN_10  /**< UART1 TX Pin       */
/** @} */ /* I2_UART1_GPIO */
/**
 * @defgroup I2_UART1_DMA UART1 DMA configurations.
 * Definition for UART1 DMA, to be defined as < CHANNEL, STREAM >.
 *
 * @{
 */
#define UART1_DMA_ENABLE          I2_DISABLE    /**< UART1 DMA Configuration  */
#define UART1_RX_DMA_CONFIG       DMA_CHANNEL_4, DMA2_Stream5 /**< UART1 DMArx*/
#define UART1_TX_DMA_CONFIG       DMA_CHANNEL_4, DMA2_Stream7 /**< UART1 DMAtx*/
/** @} */ /* I2_UART1_DMA */
/**
 * @defgroup I2_UART1_DMA_IRQn UART1 interrupt configurations.
 * Definition for UART1 DMA interrupt handlers.
 *
 * @{
 */
#define UART1_DMA_RX_IRQn         DMA2_Stream5_IRQn   /**< UART1 DMA RX IRQn  */
#define UART1_DMA_TX_IRQn         DMA2_Stream7_IRQn   /**< UART1 DMA TX IRQn  */
#define UART1_DMA_RX_IRQHandler   DMA2_Stream5_IRQHandler /**< DMA RX handler */
#define UART1_DMA_TX_IRQHandler   DMA2_Stream7_IRQHandler /**< DMA TX handler */
/** @} */ /* I2_UART1_DMA_IRQn */
/** @} */ /* I2_UART1_CONFIG */
#endif    /* I2_ENABLE_UART1_CONTEXT */
/******************************************************************************/

/* UART2 CONFIGURATION SELECTION **********************************************/
#if defined ( I2_ENABLE_UART2_CONTEXT )
/**
 * @defgroup I2_UART2_CONFIG UART2 configurations.
 * Configuration settings for UART2.
 *
 * @{
 */
/**
 * @defgroup I2_UART2_GPIO UART2 pin configurations.
 * Definition for UART2 Pins, to be defined as < PORT, PIN >.
 *
 * @{
 */
#define UART2_RX_GPIO_CONFIG      GPIOA, GPIO_PIN_2   /**< UART2 RX Pin       */
#define UART2_TX_GPIO_CONFIG      GPIOA, GPIO_PIN_3   /**< UART2 TX Pin       */
/** @} */ /* I2_UART2_GPIO */
/**
 * @defgroup I2_UART2_DMA UART2 DMA configurations.
 * Definition for UART2 DMA, to be defined as < CHANNEL, STREAM >.
 *
 * @{
 */
#define UART2_DMA_ENABLE          I2_DISABLE    /**< UART2 DMA Configuration  */
#define UART2_RX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream5 /**< UART2 DMArx*/
#define UART2_TX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream6 /**< UART2 DMAtx*/
/** @} */ /* I2_UART2_DMA */
/**
 * @defgroup I2_UART2_DMA_IRQn UART2 interrupt configurations.
 * Definition for UART2 DMA interrupt handlers.
 *
 * @{
 */
#define UART2_DMA_RX_IRQn         DMA1_Stream5_IRQn   /**< UART2 DMA RX IRQn  */
#define UART2_DMA_TX_IRQn         DMA1_Stream6_IRQn   /**< UART2 DMA TX IRQn  */
#define UART2_DMA_RX_IRQHandler   DMA1_Stream5_IRQHandler /**< DMA RX handler */
#define UART2_DMA_TX_IRQHandler   DMA1_Stream6_IRQHandler /**< DMA TX handler */
/** @} */ /* I2_UART2_DMA_IRQn */
/** @} */ /* I2_UART2_CONFIG */
#endif    /* I2_ENABLE_UART2_CONTEXT */
/******************************************************************************/

