iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
/* UART3 CONFIGURATION SELECTION **********************************************/
#if defined ( I2_ENABLE_UART3_CONTEXT )
/**
 * @defgroup I2_UART3_CONFIG UART3 configurations.
 * Configuration settings for UART3.
 *
 * @{
 */
/**
 * @defgroup I2_UART3_GPIO UART3 pin configurations.
 * Definition for UART3 Pins, to be defined as < PORT, PIN >.
 *
 * @{
 */
#define UART3_RX_GPIO_CONFIG      GPIOB, GPIO_PIN_10  /**< UART3 RX Pin       */
#define UART3_TX_GPIO_CONFIG      GPIOB, GPIO_PIN_11  /**< UART3 TX Pin       */
/** @} */ /* I2_UART3_GPIO */
/**
 * @defgroup I2_UART3_DMA UART3 DMA configurations.
 * Definition for UART3 DMA, to be defined as < CHANNEL, STREAM >.
 *
 * @{
 */
#define UART3_DMA_ENABLE          I2_DISABLE    /**< UART3 DMA Configuration  */
#define UART3_RX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream1 /**< UART3 DMArx*/
#define UART3_TX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream3 /**< UART3 DMAtx*/
/** @} */ /* I2_UART3_DMA */
/**
 * @defgroup I2_UART3_DMA_IRQn UART3 interrupt configurations.
 * Definition for UART3 DMA interrupt handlers.
 *
 * @{
 */
#define UART3_DMA_RX_IRQn         DMA1_Stream1_IRQn   /**< UART3 DMA RX IRQn  */
#define UART3_DMA_TX_IRQn         DMA1_Stream3_IRQn   /**< UART3 DMA TX IRQn  */
#define UART3_DMA_RX_IRQHandler   DMA1_Stream1_IRQHandler /**< DMA RX handler */
#define UART3_DMA_TX_IRQHandler   DMA1_Stream3_IRQHandler /**< DMA TX handler */
/** @} */ /* I2_UART3_DMA_IRQn */
/** @} */ /* I2_UART3_CONFIG */
#endif    /* I2_ENABLE_UART3_CONTEXT */
/******************************************************************************/

/* UART4 CONFIGURATION SELECTION **********************************************/
#if defined ( I2_ENABLE_UART4_CONTEXT )
/**
 * @defgroup I2_UART4_CONFIG UART4 configurations.
 * Configuration settings for UART4.
 *
 * @{
 */
/**
 * @defgroup I2_UART4_GPIO UART4 pin configurations.
 * Definition for UART4 Pins, to be defined as < PORT, PIN >.
 *
 * @{
 */
#define UART4_RX_GPIO_CONFIG      GPIOC, GPIO_PIN_10  /**< UART4 RX Pin       */
#define UART4_TX_GPIO_CONFIG      GPIOC, GPIO_PIN_11  /**< UART4 TX Pin       */
/** @} */ /* I2_UART4_GPIO */
/**
 * @defgroup I2_UART4_DMA UART4 DMA configurations.
 * Definition for UART4 DMA, to be defined as < CHANNEL, STREAM >.
 *
 * @{
 */
#define UART4_DMA_ENABLE          I2_DISABLE    /**< UART4 DMA Configuration  */
#define UART4_RX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream2 /**< UART4 DMArx*/
#define UART4_TX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream4 /**< UART4 DMAtx*/
/** @} */ /* I2_UART4_DMA */
/**
 * @defgroup I2_UART4_DMA_IRQn UART4 interrupt configurations.
 * Definition for UART4 DMA interrupt handlers.
 *
 * @{
 */
#define UART4_DMA_RX_IRQn         DMA1_Stream2_IRQn   /**< UART4 DMA RX IRQn  */
#define UART4_DMA_TX_IRQn         DMA1_Stream4_IRQn   /**< UART4 DMA TX IRQn  */
#define UART4_DMA_RX_IRQHandler   DMA1_Stream2_IRQHandler /**< DMA RX handler */
#define UART4_DMA_TX_IRQHandler   DMA1_Stream4_IRQHandler /**< DMA TX handler */
/** @} */ /* I2_UART4_DMA_IRQn */
/** @} */ /* I2_UART4_CONFIG */
#endif    /* I2_ENABLE_UART4_CONTEXT */
/******************************************************************************/

/* UART5 CONFIGURATION SELECTION **********************************************/
#if defined ( I2_ENABLE_UART5_CONTEXT )
/**
 * @defgroup I2_UART5_CONFIG UART5 configurations.
 * Configuration settings for UART5.
 *
 * @{
 */
/**
 * @defgroup I2_UART5_GPIO UART5 pin configurations.
 * Definition for UART5 Pins, to be defined as < PORT, PIN >.
 *
 * @{
 */
#define UART5_RX_GPIO_CONFIG      GPIOC, GPIO_PIN_10  /**< UART5 RX Pin       */
#define UART5_TX_GPIO_CONFIG      GPIOD, GPIO_PIN_2   /**< UART5 TX Pin       */
/** @} */ /* I2_UART5_GPIO */
/**
 * @defgroup I2_UART5_DMA UART5 DMA configurations.
 * Definition for UART5 DMA, to be defined as < CHANNEL, STREAM >.
 *
 * @{
 */
#define UART5_DMA_ENABLE          I2_DISABLE    /**< UART5 DMA Configuration  */
#define UART5_RX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream0 /**< UART5 DMArx*/
#define UART5_TX_DMA_CONFIG       DMA_CHANNEL_4, DMA1_Stream7 /**< UART5 DMAtx*/
/** @} */ /* I2_UART5_DMA */
/**
 * @defgroup I2_UART5_DMA_IRQn UART5 interrupt configurations.
 * Definition for UART5 DMA interrupt handlers.
 *
 * @{
 */
#define UART5_DMA_RX_IRQn         DMA1_Stream0_IRQn   /**< UART5 DMA RX IRQn  */
#define UART5_DMA_TX_IRQn         DMA1_Stream7_IRQn   /**< UART5 DMA TX IRQn  */
#define UART5_DMA_RX_IRQHandler   DMA1_Stream0_IRQHandler /**< DMA RX handler */
#define UART5_DMA_TX_IRQHandler   DMA1_Stream7_IRQHandler /**< DMA TX handler */
/** @} */ /* I2_UART5_DMA_IRQn */
/** @} */ /* I2_UART5_CONFIG */
#endif    /* I2_ENABLE_UART5_CONTEXT */
/******************************************************************************/

/* UART6 CONFIGURATION SELECTION **********************************************/
#if defined ( I2_ENABLE_UART6_CONTEXT )
/**
 * @defgroup I2_UART6_CONFIG UART6 configurations.
 * Configuration settings for UART6.
 *
 * @{
 */
/**
 * @defgroup I2_UART6_GPIO UART6 pin configurations.
 * Definition for UART6 Pins, to be defined as < PORT, PIN >.
 *
 * @{
 */
#define UART6_RX_GPIO_CONFIG      GPIOC, GPIO_PIN_6   /**< UART6 RX Pin       */
#define UART6_TX_GPIO_CONFIG      GPIOC, GPIO_PIN_7   /**< UART6 TX Pin       */
/** @} */ /* I2_UART6_GPIO */
/**
 * @defgroup I2_UART6_DMA UART6 DMA configurations.
 * Definition for UART6 DMA, to be defined as < CHANNEL, STREAM >.
 *
 * @{
 */
#define UART6_DMA_ENABLE          I2_DISABLE    /**< UART6 DMA Configuration  */
#define UART6_RX_DMA_CONFIG       DMA_CHANNEL_5, DMA2_Stream1 /**< UART6 DMArx*/
#define UART6_TX_DMA_CONFIG       DMA_CHANNEL_5, DMA2_Stream2 /**< UART6 DMAtx*/
/** @} */ /* I2_UART6_DMA */
/**
 * @defgroup I2_UART6_DMA_IRQn UART6 interrupt configurations.
 * Definition for UART6 DMA interrupt handlers.
 *
 * @{
 */
#define UART6_DMA_RX_IRQn         DMA2_Stream1_IRQn   /**< UART6 DMA RX IRQn  */
#define UART6_DMA_TX_IRQn         DMA2_Stream2_IRQn   /**< UART6 DMA TX IRQn  */
#define UART6_DMA_RX_IRQHandler   DMA2_Stream1_IRQHandler /**< DMA RX handler */
#define UART6_DMA_TX_IRQHandler   DMA2_Stream2_IRQHandler /**< DMA TX handler */
/** @} */ /* I2_UART6_DMA_IRQn */
/** @} */ /* I2_UART6_CONFIG */
#endif    /* I2_ENABLE_UART6_CONTEXT */
/******************************************************************************/

/**
 * @defgroup i2_uart_ctx_t UART peripheral context.
 * This defines the attributes of UART hardware controller.
 *
 * @{
 */
/** @brief UART context */
typedef struct {
  const char*           ctx_name;         /**< UART Context Name              */
  i2_gpio_inst_t        rx;               /**< GPIO Pin for UART RX           */
  i2_gpio_inst_t        tx;               /**< GPIO Pin for UART TX           */
  i2_gpio_inst_t        cts;              /**< GPIO Pin for UART CTS          */
  i2_gpio_inst_t        rts;              /**< GPIO Pin for UART RTS          */
  int32_t               baud_rate;        /**< UART channel baud rate         */
  int32_t               rx_hal_mode;      /**< UART RX HAL operation mode     */
  int32_t               tx_hal_mode;      /**< UART TX HAL operation mode     */
  bool                  initialized;      /**< UART Initialization flag       */
  USART_TypeDef*        baseaddr;         /**< UART peripheral base address   */
  uint32_t              dma_rx_channel;   /**< UART DMA RX channel            */
  DMA_Stream_TypeDef*   dma_rx_stream;    /**< UART DMA RX stream             */
  uint32_t              dma_rx_priority;  /**< UART DMA RX priority           */
  IRQn_Type             dma_rx_irqn;      /**< UART DMA RX interrupt request  */
  uint32_t              dma_tx_channel;   /**< UART DMA TX channel            */
  DMA_Stream_TypeDef*   dma_tx_stream;    /**< UART DMA TX stream             */
  uint32_t              dma_tx_priority;  /**< UART DMA TX priority           */
  IRQn_Type             dma_tx_irqn;      /**< UART DMA TX interrupt request  */
  UART_HandleTypeDef    uart;             /**< UART peripheral handler        */
  DMA_HandleTypeDef     hdma_rx;          /**< UART DMA handler for RX channel*/
  DMA_HandleTypeDef     hdma_tx;          /**< UART DMA handler for TX channel*/
#if defined ( ENABLE_RTOS_AWARE_HAL )
  SemaphoreHandle_t     mutex_rx;         /**< UART RX MUTEX                  */
  SemaphoreHandle_t     mutex_tx;         /**< UART TX MUTEX                  */
  SemaphoreHandle_t     sem_rx;           /**< UART RX Semaphore              */
  SemaphoreHandle_t     sem_tx;           /**< UART TX Semaphore              */
#endif /* ENABLE_RTOS_AWARE_HAL */
  __IO ITStatus         rx_status;        /**< UART RX interrupt status       */
  __IO ITStatus         tx_status;        /**< UART TX interrupt status       */
  i2_fifo_t             rx_fifo;          /**< FIFO object for UART RX mode   */
  uint8_t               buff[I2_UART_FIFO_SIZE];  /**< UART Buffer            */
  int32_t               rx_water_mark;    /**< UART buffer water marking      */
  int32_t               rx_trigger_level; /**< UART buffer triggering level   */
  bool                  rx_buffering_on;  /**< UART buffering flag            */
} i2_uart_ctx_t;
/** @} */ /* i2_uart_ctx_t */

