iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
/** @brief UART Context used in application */
static i2_uart_ctx_t i2_uart_ctx_table[I2_MAX_NUM_UART_CONTEXT] = {
#if defined  ( I2_ENABLE_UART1_CONTEXT )
  {
    "USART1",
    { "usart1_rx",  UART1_RX_GPIO_CONFIG },
    { "usart1_tx",  UART1_TX_GPIO_CONFIG },
    { 0, 0, 0 }, { 0, 0, 0 },
    115200,   INTERRUPT_MODE, POLLING_MODE, false,  USART1,
    UART1_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     UART1_DMA_RX_IRQn,
    UART1_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   UART1_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_UART1_CONTEXT */
#if defined ( I2_ENABLE_UART2_CONTEXT )
  {
    "USART2",
    { "usart2_rx",  UART2_RX_GPIO_CONFIG },
    { "usart2_tx",  UART2_TX_GPIO_CONFIG },
    { 0, 0, 0 }, { 0, 0, 0 },
    115200,   INTERRUPT_MODE, POLLING_MODE, false,  USART2,
    UART2_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     UART2_DMA_RX_IRQn,
    UART2_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   UART2_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_UART2_CONTEXT */
#if defined ( I2_ENABLE_UART3_CONTEXT )
  {
    "USART3",
    { "usart3_rx",  UART3_RX_GPIO_CONFIG },
    { "usart3_tx",  UART3_TX_GPIO_CONFIG },
    { 0, 0, 0 }, { 0, 0, 0 },
    115200,   INTERRUPT_MODE, POLLING_MODE, false,  USART3,
    UART3_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     UART3_DMA_RX_IRQn,
    UART3_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   UART3_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_UART3_CONTEXT */
#if defined ( I2_ENABLE_UART4_CONTEXT )
  {
    "UART4",
    { "uart4_rx",   UART4_RX_GPIO_CONFIG },
    { "uart4_tx",   UART4_TX_GPIO_CONFIG },
    { 0, 0, 0 }, { 0, 0, 0 },
    115200,   INTERRUPT_MODE, POLLING_MODE, false,  UART4,
    UART4_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     UART4_DMA_RX_IRQn,
    UART4_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   UART4_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_UART4_CONTEXT */
#if defined ( I2_ENABLE_UART5_CONTEXT )
  {
    "UART5",
    { "uart5_rx",   UART5_RX_GPIO_CONFIG },
    { "uart5_tx",   UART5_TX_GPIO_CONFIG },
    { 0, 0, 0 }, { 0, 0, 0 },
    115200,   INTERRUPT_MODE, POLLING_MODE, false,  UART5,
    UART5_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     UART5_DMA_RX_IRQn,
    UART5_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   UART5_DMA_TX_IRQn,
  },
#endif /* I2_ENABLE_UART5_CONTEXT */
#if defined ( I2_ENABLE_UART6_CONTEXT )
  {
    "UART6",
    { "uart6_rx",   UART6_RX_GPIO_CONFIG },
    { "uart6_tx",   UART6_TX_GPIO_CONFIG },
    { 0, 0, 0 }, { 0, 0, 0 },
    115200,   INTERRUPT_MODE, POLLING_MODE, false,  USART6,
    UART6_RX_DMA_CONFIG, DMA_PRIORITY_HIGH,     UART6_DMA_RX_IRQn,
    UART6_TX_DMA_CONFIG, DMA_PRIORITY_MEDIUM,   UART6_DMA_TX_IRQn,
  }
#endif /* I2_ENABLE_UART6_CONTEXT */
};

/** @brief UART Instances used in application */
static i2_uart_inst_t *i2_uart_inst_table[I2_MAX_NUM_UART_CONTEXT];

/* Define UART Contexts */
#if defined ( I2_ENABLE_UART1_CONTEXT )
static UART_HandleTypeDef *usart1   = NULL;     /**< UART1 control handler    */
#endif /* I2_ENABLE_UART1_CONTEXT */
#if defined ( I2_ENABLE_UART2_CONTEXT )
static UART_HandleTypeDef *usart2   = NULL;     /**< UART2 control handler    */
#endif /* I2_ENABLE_UART2_CONTEXT */
#if defined ( I2_ENABLE_UART3_CONTEXT )
static UART_HandleTypeDef *usart3   = NULL;     /**< UART3 control handler    */
#endif /* I2_ENABLE_UART3_CONTEXT */
#if defined ( I2_ENABLE_UART4_CONTEXT )
static UART_HandleTypeDef *uart4    = NULL;     /**< UART4 control handler    */
#endif /* I2_ENABLE_UART4_CONTEXT */
#if defined ( I2_ENABLE_UART5_CONTEXT )
static UART_HandleTypeDef *uart5    = NULL;     /**< UART5 control handler    */
#endif /* I2_ENABLE_UART5_CONTEXT */
#if defined ( I2_ENABLE_UART6_CONTEXT )
static UART_HandleTypeDef *usart6   = NULL;     /**< UART6 control handler    */
#endif /* I2_ENABLE_UART6_CONTEXT */

/* Private functions ---------------------------------------------------------*/
/**
 * @brief   UART name to context converter.
 * @details Searches for provided name in context table, and return context.
 *
 * @param[in] *name       UART context name.
 * @return  UART context object.
 */
static i2_uart_ctx_t* uart_get_ctx_from_name(const char *name)
{
  int32_t i;

  for (i = 0; i < I2_MAX_NUM_UART_CONTEXT; i++) {
    if (!strcmp(i2_uart_ctx_table[i].ctx_name, name)) {
      return &i2_uart_ctx_table[i];
    }
  }
  return NULL;
}

/**
 * @brief   Get UART context from handle.
 * @details Searches for UART handle in context table, and return context.
 *
 * @param[in] *huart        UART hadle to search.
 * @return  UART context object.
 */
static i2_uart_ctx_t* uart_get_ctx_from_handle(UART_HandleTypeDef *huart)
{
  int32_t i;

  for (i = 0; i < I2_MAX_NUM_UART_CONTEXT; i++) {
    if (&i2_uart_ctx_table[i].uart == huart) {
      return &i2_uart_ctx_table[i];
    }
  }
  return NULL;
}

/* Public functions ----------------------------------------------------------*/
/**
 * @brief   UART initialization.
 * @details Initializes UART instance along with GPIO, DMA, FIFO and interrupts.
 *
 * @param[in] *inst       UART instance to initialize.
 * @return  Initialization error code @ref I2_ERROR.
 */
i2_error i2_uart_init(i2_uart_inst_t *inst)
{
  i2_error retval = I2_SUCCESS;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;
  USART_TypeDef *base;
  IRQn_Type irqn;

  uint32_t alt;
  uint32_t hwcontrol = UART_HWCONTROL_NONE;
  uint32_t mode = 0;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  /* get UART context for required name */
  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  /* Prevent re-init */
  if ( ctx->initialized ) {
    return I2_NOT_AVAILABLE;
  }

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  /* Get the UART controller base address */
  base = ctx->baseaddr;

#if defined ( ENABLE_RTOS_AWARE_HAL )
  /* Create mutexes. */
  ctx->mutex_tx = xSemaphoreCreateMutex();
  ctx->mutex_rx = xSemaphoreCreateMutex();

  /* Create semaphores */
  ctx->sem_tx = xSemaphoreCreateBinary();
  ctx->sem_rx = xSemaphoreCreateBinary();
#endif /* ENABLE_RTOS_AWARE_HAL */
  ctx->tx_status = I2_TRANSFER_DONE;
  ctx->rx_status = I2_TRANSFER_DONE;

