iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
  if ( base == USART1 ) {
#if defined ( I2_ENABLE_UART1_CONTEXT )
    usart1 = huart;
    irqn = USART1_IRQn;
    alt = GPIO_AF7_USART1;            /* USART1 will always associate to AF7 */
    __HAL_RCC_USART1_CLK_ENABLE();
    if ( (ctx->rx_hal_mode == DMA_MODE) ||
         (ctx->tx_hal_mode == DMA_MODE) ) {
      __HAL_RCC_DMA2_CLK_ENABLE();    /* USART1 will always associate to DMA2 */
    }
#else
    return I2_NOT_AVAILABLE;
#endif /* I2_ENABLE_UART1_CONTEXT */
  } else if ( base == USART2 ) {
#if defined ( I2_ENABLE_UART2_CONTEXT )
    irqn = USART2_IRQn;
    usart2 = huart;
    alt = GPIO_AF7_USART2;            /* USART2 will always associate to AF7 */
    __HAL_RCC_USART2_CLK_ENABLE();
    if ( (ctx->rx_hal_mode == DMA_MODE) ||
         (ctx->tx_hal_mode == DMA_MODE) ) {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
#else
    return I2_NOT_AVAILABLE;
#endif /* I2_ENABLE_UART2_CONTEXT */
  } else if ( base == USART3 ) {
#if defined ( I2_ENABLE_UART3_CONTEXT )
    usart3 = huart;
    irqn = USART3_IRQn;
    alt = GPIO_AF7_USART3;            /* USART3 will always associate to AF7 */
    __HAL_RCC_USART3_CLK_ENABLE();
    if ( (ctx->rx_hal_mode == DMA_MODE) ||
         (ctx->tx_hal_mode == DMA_MODE) ) {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
#else
    return I2_NOT_AVAILABLE;
#endif /* I2_ENABLE_UART3_CONTEXT */
  } else if ( base == UART4 ) {
#if defined ( I2_ENABLE_UART4_CONTEXT )
    uart4 = huart;
    irqn = UART4_IRQn;
    alt = GPIO_AF8_UART4;            /* UART4 will always associate to AF8 */
    __HAL_RCC_UART4_CLK_ENABLE();
    if ( (ctx->rx_hal_mode == DMA_MODE) ||
         (ctx->tx_hal_mode == DMA_MODE) ) {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
#else
    return I2_NOT_AVAILABLE;
#endif /* I2_ENABLE_UART4_CONTEXT */
  } else if ( base == UART5 ) {
#if defined ( I2_ENABLE_UART5_CONTEXT )
    uart5 = huart;
    irqn = UART5_IRQn;
    alt = GPIO_AF8_UART5;            /* UART5 will always associate to AF8 */
    __HAL_RCC_UART5_CLK_ENABLE();
    if ( (ctx->rx_hal_mode == DMA_MODE) ||
         (ctx->tx_hal_mode == DMA_MODE) ) {
      __HAL_RCC_DMA1_CLK_ENABLE();
    }
#else
    return I2_NOT_AVAILABLE;
#endif /* I2_ENABLE_UART5_CONTEXT */
  } else if ( base == USART6 ) {
#if defined ( I2_ENABLE_UART6_CONTEXT )
    usart6 = huart;
    irqn = USART6_IRQn;
    alt = GPIO_AF8_USART6;            /* USART6 will always associate to AF8 */
    __HAL_RCC_USART6_CLK_ENABLE();
    if ( (ctx->rx_hal_mode == DMA_MODE) ||
         (ctx->tx_hal_mode == DMA_MODE) ) {
      __HAL_RCC_DMA2_CLK_ENABLE();
    }
#else
    return I2_NOT_AVAILABLE;
#endif /* I2_ENABLE_UART6_CONTEXT */
  } else {
    return I2_INVALID_PARAM;
  }

  /* UART driver needs gpio */
  i2_gpio_init();

  /* Configure TX */
  if ( i2_gpio_is_valid(&ctx->tx) ) {
    i2_gpio_config_alt(&ctx->tx, GPIO_MODE_AF_PP, GPIO_PULLUP, alt);
    mode |= UART_MODE_TX;
  }

  /* Configure RX */
  if ( i2_gpio_is_valid(&ctx->rx) ) {
    i2_gpio_config_alt(&ctx->rx, GPIO_MODE_AF_PP, GPIO_PULLUP, alt);
    mode |= UART_MODE_RX;
  }

  /* Configure CTS */
  if ( i2_gpio_is_valid(&ctx->cts) ) {
    i2_gpio_config_alt(&ctx->cts, GPIO_MODE_AF_OD, GPIO_PULLUP, alt);
    hwcontrol |= UART_HWCONTROL_CTS;
  }

  /* Configure RTS */
  if ( i2_gpio_is_valid(&ctx->rts) ) {
    i2_gpio_config_alt(&ctx->rts, GPIO_MODE_AF_OD, GPIO_PULLUP, alt);
    hwcontrol |= UART_HWCONTROL_RTS;
  }

  /* DMA RX Config */
  if (ctx->rx_hal_mode == DMA_MODE) {
    /* Configure the DMA handler for reception process */
    ctx->hdma_rx.Instance                 = ctx->dma_rx_stream;
    ctx->hdma_rx.Init.Channel             = ctx->dma_rx_channel;
    ctx->hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    ctx->hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    ctx->hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
    ctx->hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    ctx->hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    ctx->hdma_rx.Init.Mode                = DMA_CIRCULAR;
    ctx->hdma_rx.Init.Priority            = ctx->dma_rx_priority;
    ctx->hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    ctx->hdma_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    ctx->hdma_rx.Init.MemBurst            = DMA_MBURST_SINGLE;
    ctx->hdma_rx.Init.PeriphBurst         = DMA_PBURST_SINGLE;

    HAL_DMA_Init(&ctx->hdma_rx);

    /* Associate the initialized DMA handle to the the UART handle */
    __HAL_LINKDMA(huart, hdmarx, ctx->hdma_rx);

    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority(ctx->dma_rx_irqn, UART_DMA_PREEMPTION_PRIORITY,
                          UART_DMA_SUB_PRIORITY);
    HAL_NVIC_EnableIRQ(ctx->dma_rx_irqn);
  }

  /* DMA TX Config */
  if (ctx->tx_hal_mode == DMA_MODE) {
    /* Configure the DMA handler for Transmission process */
    ctx->hdma_tx.Instance                 = ctx->dma_tx_stream;
    ctx->hdma_tx.Init.Channel             = ctx->dma_tx_channel;
    ctx->hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    ctx->hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    ctx->hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
    ctx->hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    ctx->hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
    ctx->hdma_tx.Init.Mode                = DMA_NORMAL;
    ctx->hdma_tx.Init.Priority            = ctx->dma_tx_priority;
    ctx->hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
    ctx->hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
    ctx->hdma_tx.Init.MemBurst            = DMA_MBURST_SINGLE;
    ctx->hdma_tx.Init.PeriphBurst         = DMA_PBURST_SINGLE;

    HAL_DMA_Init(&ctx->hdma_tx);

    /* Associate the initialized DMA handle to the UART handle */
    __HAL_LINKDMA(huart, hdmatx, ctx->hdma_tx);

    /* NVIC configuration for DMA transfer complete interrupt */
    HAL_NVIC_SetPriority(ctx->dma_tx_irqn, UART_DMA_PREEMPTION_PRIORITY,
                          UART_DMA_SUB_PRIORITY);
    HAL_NVIC_EnableIRQ(ctx->dma_tx_irqn);
  }

  if ((ctx->rx_hal_mode == DMA_MODE) || (ctx->rx_hal_mode == INTERRUPT_MODE) ||
      (ctx->tx_hal_mode == DMA_MODE) || (ctx->tx_hal_mode == INTERRUPT_MODE) ) {
    /* NVIC configuration for UART */
    HAL_NVIC_SetPriority(irqn, UART_PREEMPTION_PRIORITY, UART_SUB_PRIORITY);
    HAL_NVIC_EnableIRQ(irqn);
  }

  /* UART configuration */
  huart->Instance                      = base;
  huart->Init.BaudRate                 = ctx->baud_rate;
  huart->Init.HwFlowCtl                = hwcontrol;
  huart->Init.Mode                     = mode;
  /* Assume these values can be fixed for all UART for now */
  huart->Init.WordLength               = UART_WORDLENGTH_8B;
  huart->Init.StopBits                 = UART_STOPBITS_1;
  huart->Init.Parity                   = UART_PARITY_NONE;
  huart->Init.OverSampling             = UART_OVERSAMPLING_8;

  if (HAL_UART_Init(huart) != HAL_OK) {
    retval = I2_FAILURE;
  } else {
    int32_t i;
    for ( i = 0; i < I2_MAX_NUM_UART_CONTEXT; i++ ) {
      if ( !i2_uart_inst_table[i] ) {
        i2_uart_inst_table[i] = inst;
        break;
      }
    }
  }

