iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
  i2_fifo_init(&ctx->rx_fifo, ctx->buff, I2_UART_FIFO_SIZE);

  ctx->initialized        = true;
  ctx->rx_trigger_level   = I2_UART_FIFO_HALF_SIZE;
  ctx->rx_buffering_on    = false;
  ctx->rx_water_mark      = 0;

  return retval;
}

/**
 * @brief   UART Reset.
 * @details Abort current TX/RX activity & re-init the UART controller and FIFO.
 *
 * @param[in] *inst       UART instance to reset.
 * @return  Initialization error code @ref I2_ERROR.
 */
i2_error i2_uart_reset(i2_uart_inst_t *inst)
{
  i2_error err = I2_SUCCESS;
  HAL_StatusTypeDef retval;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  retval = HAL_UART_Abort(huart);
  if ( retval != HAL_OK ) {
    goto out;
  }

  huart->Init.BaudRate = ctx->baud_rate;
  retval = HAL_UART_Init(huart);

  i2_fifo_reset(&ctx->rx_fifo);
#if defined ( ENABLE_RTOS_AWARE_HAL )
  /* Reset the semaphore back to 0 */
  xSemaphoreTake(ctx->sem_rx, (TickType_t)1);
#endif /* ENABLE_RTOS_AWARE_HAL */
  ctx->tx_status = I2_TRANSFER_DONE;
  ctx->rx_status = I2_TRANSFER_DONE;

out:
  err = i2_get_hal_error( retval );
  return err;
}

/**
 * @brief   UART name to instance converter.
 * @details Searches for provided name in instance table, and return instance.
 *
 * @param[in] *inst_name        UART instance name.
 * @return  UART instance object.
 */
i2_uart_inst_t* i2_uart_inst_get(char *inst_name)
{
  int32_t i;

  for (i = 0; i < I2_MAX_NUM_UART_CONTEXT; i++) {
    if (!strcmp(i2_uart_inst_table[i]->inst_name, inst_name)) {
      return i2_uart_inst_table[i];
    }
  }

  return NULL;
}

/**
 * @brief   UART transmission function.
 * @details The interrupt/DMA based UARt transmission functions.
 *
 * @param[in]   *inst       UART instance to use.
 * @param[in]   *txbuf      buffer to transmit.
 * @param[in]   size        Number of bytes to send.
 * @param[out]  *num_bytes  Number of bytes actually sent.
 * @param[in]   *timeout    UART peripheral HAL timeput.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    It will block until the UART TX is finished.
 */
i2_error i2_uart_tx(i2_uart_inst_t *inst, uint8_t *txbuf, int32_t size,
                    int32_t *num_bytes, uint32_t timeout)
{
  i2_error err = I2_FAILURE;
  HAL_StatusTypeDef retval;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined( ENABLE_RTOS_AWARE_HAL )
  if (xSemaphoreTake(ctx->mutex_tx, (TickType_t)timeout) == pdFALSE) {
    if ( num_bytes ) {
      *num_bytes = 0;
    }
    return I2_TIMEOUT;
  }
#endif /* ENABLE_RTOS_AWARE_HAL */

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  ctx->tx_status = I2_TRANSFER_WAIT;

  if (ctx->tx_hal_mode == INTERRUPT_MODE) {
    retval = HAL_UART_Transmit_IT(huart, txbuf, size);
  } else if (ctx->tx_hal_mode == DMA_MODE) {
    retval = HAL_UART_Transmit_DMA(huart, txbuf, size);
  } else {
    err = I2_NOT_SUPPORTED;
    goto err;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  if (xSemaphoreTake(ctx->sem_tx, (TickType_t)timeout) == pdFALSE) {
    retval = HAL_TIMEOUT;
  } /* ENABLE_RTOS_AWARE_HAL */
#else
  while (ctx->tx_status == I2_TRANSFER_WAIT);
#endif

  err = i2_get_hal_error(retval);

  /* Check for error interrupt */
  if ( ctx->tx_status == I2_TRANSFER_ERROR ) {
    err = I2_FAILURE;
  } else if (ctx->tx_status == I2_TRANSFER_WAIT) {
  /* Tx Complete interrupt was not received */
    err = I2_TIMEOUT;
  }

  /* Record correct number of sent bytes */
  if ( num_bytes ) {
    if ((err == I2_SUCCESS) || (err == I2_TIMEOUT)) {
      *num_bytes = (size - huart->TxXferCount);
    } else {
      *num_bytes = 0;
    }
  }

  if ( err != I2_SUCCESS ) {
    HAL_UART_AbortTransmit(huart);
  }

err:
#if defined ( ENABLE_RTOS_AWARE_HAL )
  xSemaphoreGive(ctx->mutex_tx);
#endif /* ENABLE_RTOS_AWARE_HAL */

  return err;
}

/**
 * @brief   UART polling transmission API.
 * @details Polling based UART transmission API.
 *
 * @param[in]   *inst       UART instance to use.
 * @param[in]   *txbuf      buffer to transmit.
 * @param[in]   size        Number of bytes to send.
 * @param[out]  *num_bytes  Number of bytes actually sent.
 * @param[in]   *timeout    UART peripheral HAL timeput.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    It can be used along with interrupt/DMA based i2_uart_tx() API
 *          without any special precaution.
 */
i2_error i2_uart_tx_polling(i2_uart_inst_t *inst, uint8_t *txbuf, int32_t size,
                            int32_t *num_bytes, uint32_t timeout)
{
  i2_error err = I2_FAILURE;
  HAL_StatusTypeDef retval;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  if (xSemaphoreTake(ctx->mutex_tx, (TickType_t)timeout) == pdFALSE) {
    if ( num_bytes ) {
      *num_bytes = 0;
    }
    return I2_TIMEOUT;
  }
#endif /* ENABLE_RTOS_AWARE_HAL */

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  retval = HAL_UART_Transmit(huart, txbuf, size, (TickType_t)timeout);
  err = i2_get_hal_error(retval);

  /* Record correct number of sent bytes */
  if ( num_bytes ) {
    if ((err == I2_SUCCESS) || (err == I2_TIMEOUT)) {
      *num_bytes = (size - huart->TxXferCount);
    } else {
      *num_bytes = 0;
    }
  }

  if ( err != I2_SUCCESS ) {
    HAL_UART_AbortTransmit(huart);
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  xSemaphoreGive(ctx->mutex_tx);
#endif /* ENABLE_RTOS_AWARE_HAL */

  return err;
}

/**
 * @brief   Start buffering continuous RX stream.
 * @details Then the UART controller will be  buffering RX data into the
 *          internal FIFO buffer associated with the UART controller.
 *          The FIFO buffer size is statically decided at the compile time.
 *
 * @param[in] *inst       UART instance to use.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    It needs to be called by UART device drivers after uart_init.
 */
i2_error i2_uart_rx_buffering_start(i2_uart_inst_t *inst)
{
  i2_error err = I2_SUCCESS;
  HAL_StatusTypeDef retval;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;

