iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  if ( ctx->rx_hal_mode == INTERRUPT_MODE ) {
    retval = HAL_UART_Receive_IT(huart, (uint8_t*)ctx->buff, I2_UART_FIFO_SIZE);
  } else if ( ctx->rx_hal_mode == DMA_MODE ) {
    retval = HAL_UART_Receive_DMA(huart, (uint8_t*)ctx->buff, I2_UART_FIFO_SIZE);
  } else {
    err = I2_NOT_SUPPORTED;
  }

  if ( err == I2_SUCCESS ) {
    err = i2_get_hal_error(retval);
    if ( err == I2_SUCCESS ) {
      ctx->rx_buffering_on = true;
    }
  }

  return err;
}

/**
 * @brief   Stop buffering continuous RX stream.
 * @details The RX receiver will be disabled &  FIFO buffer will be cleared out.
 *
 * @param[in]   *inst       UART instance to use.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    It needs to be called by UART device drivers after uart_init.
 */
i2_error i2_uart_rx_buffering_stop(i2_uart_inst_t *inst)
{
  i2_error err = I2_SUCCESS;
  HAL_StatusTypeDef retval;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  retval = HAL_UART_AbortReceive(huart);
  i2_fifo_reset(&ctx->rx_fifo);

#if defined ( ENABLE_RTOS_AWARE_HAL )
  /* Reset the semaphore back to 0 */
  xSemaphoreTake(ctx->sem_rx, (TickType_t)1);
#endif /* ENABLE_RTOS_AWARE_HAL */
  ctx->rx_status = I2_TRANSFER_DONE;
  ctx->rx_water_mark = 0;

  err = i2_get_hal_error(retval);
  if (err == I2_SUCCESS) {
    ctx->rx_buffering_on = false;
  }

  return err;
}

/**
 * @brief   UART receiving function.
 * @details The interrupt/DMA based UART reception can be called by users after
 *          UART RX buffering starts.
 * Let's say this function is called with the caller buffer of size X bytes
 * and time out T msec.
 * If there is already *any* number of bytes in the UART driver's receive FIFO,
 * this function returns right away regardless of X or T values.
 * If the UART driver's receive FIFO is empty at the time of calling this
 * function the caller will block on UART RX semaphore until one of the
 * following conditions is met:
 * a) UART driver's receive FIFO gets *any* number of bytes, followed by UART RX
 *    line going idle regardless of X or T values.
 * b) UART driver's receive FIFO gets filled up to half full without the UART RX
 *    line going idle regardless of X or T values.
 * c) UART driver does not get any byte in the UART driver's receive FIFO until
 *    the timeout expires, then this funciton returns with no data.
 *    It's indicated by the *num_bytes being zero and also by the return value.
 * In a) and b) cases, if the caller's buffer size X happens to be smaller than
 * the available number of UART RX bytes in the UART driver's receive FIFO, then
 * the UART driver copies X number of bytes first and the caller must call
 * this function again to read in the remaining bytes.
 * It's important to remember whenever UART RX line goes idle after receiving
 * any number of bytes, this function will return. This is done to meet UART RX
 * responsiveness requirement, as UART driver can't wait until either buffer
 * gets full or timeout happens from the performance point of view.
 * Also note that if the caller does not read out data in UART receive FIFO
 * fast enough, the buffered data in the FIFO will start to be overwritten
 * by new data.
 *
 * @param[in]   *inst       UART instance to use.
 * @param[in]   *rxbuf      buffer to receive data in.
 * @param[in]   size        Number of bytes to receive.
 * @param[out]  *num_bytes  Number of bytes actually received.
 * @param[in]   *timeout    UART peripheral HAL timeput.
 * @return  Execution error code @ref I2_ERROR.
 */
i2_error i2_uart_rx(i2_uart_inst_t *inst, uint8_t *rxbuf, int32_t size,
                    int32_t *num_bytes, uint32_t timeout)
{
  i2_error err = I2_FAILURE;
  i2_uart_ctx_t *ctx;
  int32_t _size;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  /* Make sure one thread uses one controller at a time */
  if (xSemaphoreTake(ctx->mutex_rx, (TickType_t)timeout) == pdFALSE) {
    if ( num_bytes ) {
      *num_bytes = 0;
    }
    return I2_TIMEOUT;
  }
#endif /* ENABLE_RTOS_AWARE_HAL */

  /* desired read size */
  _size = size;

  /* If the FIFO is empty, wait for signal */
  if ( !i2_fifo_count(&ctx->rx_fifo, false) ) {
      ctx->rx_status = I2_TRANSFER_WAIT;
 #if defined ( ENABLE_RTOS_AWARE_HAL)
      if (xSemaphoreTake(ctx->sem_rx, (TickType_t)timeout) == pdFALSE) {
        err = I2_TIMEOUT;
      }
#else /* ENABLE_RTOS_AWARE_HAL */
      while (ctx->rx_status == I2_TRANSFER_WAIT);
#endif
  }

  /* RX ISR says the FIFO is at least half full or rx line is idle */
  if ( err != I2_TIMEOUT ) {
    i2_fifo_copy(&ctx->rx_fifo, rxbuf, &_size, false);
  } else {
    _size = 0;
  }

  /* Record correct number of received bytes */
  if ( num_bytes ) {
    *num_bytes = _size;
  }

  /* If we return without data, it's a timeout */
  if ( _size ) {
    err = I2_SUCCESS;
  } else {
    err = I2_TIMEOUT;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  xSemaphoreGive(ctx->mutex_rx);
#endif /* ENABLE_RTOS_AWARE_HAL */

  return err;
}

/**
 * @brief   UART polling reception API.
 * @details Polling based UART reception API.
 *
 * @param[in]   *inst       UART instance to use.
 * @param[in]   *rxbuf      buffer to receive in.
 * @param[in]   size        Number of bytes to receive.
 * @param[out]  *num_bytes  Number of bytes actually received.
 * @param[in]   *timeout    UART peripheral HAL timeput.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    Disable UART RX buffering first before reading RX bytes.
 */
i2_error i2_uart_rx_polling(i2_uart_inst_t *inst, uint8_t *rxbuf, int32_t size,
                            int32_t *num_bytes, uint32_t timeout)
{
  i2_error err = I2_FAILURE;
  HAL_StatusTypeDef retval;
  i2_uart_ctx_t *ctx;
  UART_HandleTypeDef *huart;

