iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  if (xSemaphoreTake(ctx->mutex_rx, (TickType_t)timeout) == pdFALSE) {
    if ( num_bytes ) {
      *num_bytes = 0;
    }
    return I2_TIMEOUT;
  }
#endif /* ENABLE_RTOS_AWARE_HAL */

  /* Get the pointer to the UART handle */
  huart = &(ctx->uart);

  retval = HAL_UART_Receive(huart, rxbuf, size, (TickType_t) timeout);

  err = i2_get_hal_error(retval);

  /* Record correct number of received bytes */
  if ( num_bytes ) {
    if ( (err == I2_SUCCESS) || (err == I2_TIMEOUT) ) {
      *num_bytes = (size - huart->RxXferCount);
    } else {
      *num_bytes = 0;
    }
  }

  if ( err != I2_SUCCESS ) {
    HAL_UART_AbortReceive(huart);
  }

#if defined ( ENABLE_RTOS_AWARE_HAL )
  xSemaphoreGive(ctx->mutex_rx);
#endif /* ENABLE_RTOS_AWARE_HAL */

  return err;
}

#if defined ( I2_ENABLE_UART1_CONTEXT )
/**
 * @brief   UART1 interrupt Handler.
 * @details Generic interrupt handler for UART1.
 *
 * @return  None.
 */
void USART1_IRQHandler(void)
{
  HAL_UART_IRQHandler(usart1);
}
#if ( UART1_DMA_ENABLE == I2_ENABLE )
/**
 * @brief   UART1 DMA receive interrupt Handler.
 * @details DMA receive interrupt handler for UART1.
 *
 * @return  None.
 */
void UART1_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart1->hdmarx);
}

/**
 * @brief   UART1 DMA transmit interrupt Handler.
 * @details DMA transmit interrupt handler for UART1.
 *
 * @return  None.
 */
void UART1_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart1->hdmatx);
}
#endif /* UART1_DMA_ENABLE */
#endif /* I2_ENABLE_UART1_CONTEXT */

#if defined ( I2_ENABLE_UART2_CONTEXT )
/**
 * @brief   UART2 interrupt Handler.
 * @details Generic interrupt handler for UART2.
 *
 * @return  None.
 */
void USART2_IRQHandler(void)
{
  HAL_UART_IRQHandler(usart2);
}
#if ( UART2_DMA_ENABLE == I2_ENABLE )
/**
 * @brief   UART2 DMA receive interrupt Handler.
 * @details DMA receive interrupt handler for UART2.
 *
 * @return  None.
 */
void UART2_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart2->hdmarx);
}

/**
 * @brief   UART2 DMA transmit interrupt Handler.
 * @details DMA transmit interrupt handler for UART2.
 *
 * @return  None.
 */
void UART2_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart2->hdmatx);
}
#endif /* UART2_DMA_ENABLE */
#endif /* I2_ENABLE_UART2_CONTEXT */

#if defined ( I2_ENABLE_UART3_CONTEXT )
/**
 * @brief   UART3 interrupt Handler.
 * @details Generic interrupt handler for UART3.
 *
 * @return  None.
 */
void USART3_IRQHandler(void)
{
  HAL_UART_IRQHandler(usart3);
}
#if ( UART3_DMA_ENABLE == I2_ENABLE )
/**
 * @brief   UART3 DMA receive interrupt Handler.
 * @details DMA receive interrupt handler for UART3.
 *
 * @return  None.
 */
void UART3_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart3->hdmarx);
}

/**
 * @brief   UART3 DMA transmit interrupt Handler.
 * @details DMA transmit interrupt handler for UART3.
 *
 * @return  None.
 */
void UART3_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart3->hdmatx);
}
#endif /* UART3_DMA_ENABLE */
#endif /* I2_ENABLE_UART3_CONTEXT */

#if defined ( I2_ENABLE_UART4_CONTEXT )
/**
 * @brief   UART4 interrupt Handler.
 * @details Generic interrupt handler for UART4.
 *
 * @return  None.
 */
void UART4_IRQHandler(void)
{
  HAL_UART_IRQHandler(uart4);
}
#if ( UART4_DMA_ENABLE == I2_ENABLE )
/**
 * @brief   UART4 DMA receive interrupt Handler.
 * @details DMA receive interrupt handler for UART4.
 *
 * @return  None.
 */
void UART4_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(uart4->hdmarx);
}

/**
 * @brief   UART4 DMA transmit interrupt Handler.
 * @details DMA transmit interrupt handler for UART4.
 *
 * @return  None.
 */
void UART4_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(uart4->hdmatx);
}
#endif /* UART4_DMA_ENABLE */
#endif /* I2_ENABLE_UART4_CONTEXT */

#if defined ( I2_ENABLE_UART5_CONTEXT )
/**
 * @brief   UART5 interrupt Handler.
 * @details Generic interrupt handler for UART5.
 *
 * @return  None.
 */
void UART5_IRQHandler(void)
{
  HAL_UART_IRQHandler(uart5);
}
#if ( UART5_DMA_ENABLE == I2_ENABLE )
/**
 * @brief   UART5 DMA receive interrupt Handler.
 * @details DMA receive interrupt handler for UART5.
 *
 * @return  None.
 */
void UART5_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(uart5->hdmarx);
}

/**
 * @brief   UART5 DMA transmit interrupt Handler.
 * @details DMA transmit interrupt handler for UART5.
 *
 * @return  None.
 */
void UART5_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(uart5->hdmatx);
}
#endif /* UART5_DMA_ENABLE */
#endif /* I2_ENABLE_UART5_CONTEXT */

#if defined ( I2_ENABLE_UART6_CONTEXT )
/**
 * @brief   UART6 interrupt Handler.
 * @details Generic interrupt handler for UART6.
 *
 * @return  None.
 */
void USART6_IRQHandler(void)
{
  HAL_UART_IRQHandler(usart6);
}
#if ( UART6_DMA_ENABLE == I2_ENABLE )
/**
 * @brief   UART6 DMA receive interrupt Handler.
 * @details DMA receive interrupt handler for UART6.
 *
 * @return  None.
 */
void UART6_DMA_RX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart6->hdmarx);
}

/**
 * @brief   UART6 DMA transmit interrupt Handler.
 * @details DMA transmit interrupt handler for UART6.
 *
 * @return  None.
 */
void UART6_DMA_TX_IRQHandler(void)
{
  HAL_DMA_IRQHandler(usart6->hdmatx);
}
#endif /* UART6_DMA_ENABLE */
#endif /* I2_ENABLE_UART6_CONTEXT */

#if 0
/**
 * @brief   UART receive interrupt.
 * @details Genaric interrupt for UART receive.
 *
 * @param[in] *huart      UART handler.
 * @return  None.
 */
void UART_Receive_IT(UART_HandleTypeDef *huart)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
  static BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
  uint16_t uhdata;
  i2_uart_ctx_t *ctx = uart_get_ctx_from_handle(huart);
  int32_t count;

  /* Check that a Rx process is ongoing */
  if (huart->RxState == HAL_UART_STATE_BUSY_RX) {
    /* Reading RDR will clear the RXNE */
    uhdata = (uint16_t)READ_REG(huart->Instance->DR);

    if ( !ctx ) {
      return;
    }

    /* Read the RX byte */
    count = i2_fifo_write(&ctx->rx_fifo, (uint8_t) uhdata, true);

    /* Signal uart_rx that the FIFO is at the trigger level */
    if (count == ctx->rx_trigger_level) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
      xSemaphoreGiveFromISR(ctx->sem_rx, &xHigherPriorityTaskWoken);
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* ENABLE_RTOS_AWARE_HAL */
      ctx->rx_status = I2_TRANSFER_DONE;
    }

    /* Update the water mark */
    if (ctx->rx_water_mark < count) {
      ctx->rx_water_mark = count;
    }
  } else {
    /* Clear RXNE interrupt flag */
    __HAL_UART_SEND_REQ(huart, UART_RXDATA_FLUSH_REQUEST);
  }

  return;
}

/**
 * @brief   UART idle interrupt.
 * @details Genaric interrupt for idle UART bus.
 *
 * @param[in] *huart      UART handler.
 * @return  None.
 */
void UART_Idle_IT(UART_HandleTypeDef *huart)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
    static BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
    struct i2_uart_ctx_t *ctx = uart_get_ctx_from_handle(huart);

    /* If RX line idle is detected, signal uart_rx */
    __HAL_UART_CLEAR_IT(huart, UART_CLEAR_IDLEF);

    if (!ctx)
        return;

