iota2/iota2-hub/iota2/i2_STM32F4xx_HAL_Driver/src/i2_stm32f4xx_hal_uart.c
    if (ctx->rx_hal_mode == DMA_MODE) {
        ctx->rxfifo.wr_index = (I2_UART_FIFO_SIZE - ctx->hdma_rx.Instance->CNDTR);
    }

    if (fifo_count(&ctx->rxfifo, true)) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
        xSemaphoreGiveFromISR(ctx->sem_rx, &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken)
#endif /* ENABLE_RTOS_AWARE_HAL */
        ctx->rx_status = I2_TRANSFER_DONE;
    }

    return;
}
#endif /* 0 */

/**
 * @brief   UART DMA receive half compete callback.
 * @details System callback for DMA reception half completion.
 *
 * @param[in] *huart      UART handler.
 * @return  None.
 */
void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
  BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
  i2_uart_ctx_t *ctx = uart_get_ctx_from_handle(huart);

  if ( ctx ) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
    xSemaphoreGiveFromISR(ctx->sem_rx, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* ENABLE_RTOS_AWARE_HAL */
    ctx->rx_status = I2_TRANSFER_DONE;
    ctx->rx_fifo.wr_index = (I2_UART_FIFO_SIZE - ctx->hdma_rx.Instance->NDTR);
  }
}

/**
 * @brief   UART DMA receive compete callback.
 * @details System callback for DMA reception completion.
 *
 * @param[in] *huart      UART handler.
 * @return  None.
 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
  static BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
  i2_uart_ctx_t *ctx = uart_get_ctx_from_handle(huart);

  if (ctx) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
    xSemaphoreGiveFromISR(ctx->sem_rx, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* ENABLE_RTOS_AWARE_HAL */
    ctx->rx_status = I2_TRANSFER_DONE;
    ctx->rx_fifo.wr_index = (I2_UART_FIFO_SIZE - ctx->hdma_rx.Instance->NDTR);
  }
}

/**
 * @brief   UART DMA transmit compete callback.
 * @details System callback for DMA transmission completion.
 *
 * @param[in] *huart      UART handler.
 * @return  None.
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
#if defined ( ENABLE_RTOS_AWARE_HAL )
  static BaseType_t xHigherPriorityTaskWoken;
#endif /* ENABLE_RTOS_AWARE_HAL */
  i2_uart_ctx_t *ctx = uart_get_ctx_from_handle(huart);

  if (ctx) {
#if defined ( ENABLE_RTOS_AWARE_HAL )
    xSemaphoreGiveFromISR(ctx->sem_tx, &xHigherPriorityTaskWoken);
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
#endif /* ENABLE_RTOS_AWARE_HAL */
    ctx->tx_status = I2_TRANSFER_DONE;
  }
}

/**
 * @brief   Set the UART RX FIFO level.
 * @details Set the UART RX FIFO level at which the i2_uart_rx() call's blocking
 *          semaphore will be released. Thus, the calling function will have the
 *          chance to read out the RX buffer to avoid the FIFO overrun.
 *
 * @param[in] *inst             UART instance.
 * @param[in] rx_trigger_level  Rx trigger level to set.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    It defaults to half of the FIFO depth. The UART RX buffering needs
 *          to be disabled first to successfully call it.
 */
i2_error i2_uart_rx_trigger_level_set(i2_uart_inst_t *inst,
                                      int32_t rx_trigger_level)
{
  i2_error err = I2_SUCCESS;
  i2_uart_ctx_t *ctx;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  if ( !ctx->rx_buffering_on ) {
    ctx->rx_trigger_level = rx_trigger_level;
  } else {
    err = I2_BUSY;
  }

  return err;
}

/**
 * @brief   Get the UART RX FIFO level.
 * @details Reads the tx trigger level.
 *
 * @param[in]  *inst              UART instance.
 * @param[out] *rx_trigger_level  Rx trigger level value.
 * @return  Execution error code @ref I2_ERROR.
 */
i2_error i2_uart_rx_trigger_level_get(i2_uart_inst_t *inst,
                                      int32_t *rx_trigger_level)
{
  i2_uart_ctx_t *ctx;

  if ( !inst || !rx_trigger_level ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  *rx_trigger_level = ctx->rx_trigger_level;

  return I2_SUCCESS;
}

/**
 * @brief   Get the current RX water mark level.
 * @details The water mark is the highest FIFO level at which it has ever been.
 *          and the trigger level programming.
 *
 * @param[in] *inst             UART instance.
 * @param[out] *rx_water_mark   UART maximum FIFO level reached value.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    This information is used to tweak the FIFO depth.
 */
i2_error i2_uart_rx_water_mark_get(i2_uart_inst_t *inst, int32_t *rx_water_mark)
{
  i2_uart_ctx_t *ctx;

  if ( !inst || !rx_water_mark ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  *rx_water_mark = ctx->rx_water_mark;

  return I2_SUCCESS;
}

/**
 * @brief   Reads RX byte count.
 * @details Get the current number of byte count in RX FIFO.
 *
 * @param[in]  *inst            UART instance.
 * @param[out] *count           UART RX FIFO bytes count.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    It's assumed that it's called in a task context.
 *          Do not call this in ISR.
 */
i2_error i2_uart_rx_byte_count_get(i2_uart_inst_t *inst, int32_t *count)
{
  i2_uart_ctx_t *ctx;

  if ( !inst || !count ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  *count = i2_fifo_count(&ctx->rx_fifo, false);

  return I2_SUCCESS;
}

/**
 * @brief   Reads RX FIFO size.
 * @details Get the fixed RX FIFO size.
 *          Not to be confused with i2_uart_rx_count_count_get.
 *
 * @param[in]  *inst            UART instance.
 * @param[out] *size            UART FIFO Size.
 * @return  Execution error code @ref I2_ERROR.
 */
i2_error i2_uart_rx_fifo_size_get(i2_uart_inst_t *inst, int32_t *size)
{
  i2_uart_ctx_t *ctx;

  if ( !inst || !size ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  *size = i2_fifo_size(&ctx->rx_fifo);

  return I2_SUCCESS;
}

/**
 * @brief   Change the UART baud rate.
 * @details Use this API to change baud rate of an already initialized UARt.
 *
 * @param[in] *inst             UART instance.
 * @param[in] *baud_rate        Baud rate to be configured.
 * @return  Execution error code @ref I2_ERROR.
 *
 * @note    The UART RX buffering needs to be stopped first.
 */
i2_error i2_uart_baud_rate_set(i2_uart_inst_t *inst, int32_t baud_rate)
{
  i2_uart_ctx_t *ctx;

  if ( !inst ) {
    return I2_INVALID_PARAM;
  }

  ctx = uart_get_ctx_from_name(inst->ctx_name);
  if ( !ctx ) {
    return I2_INVALID_PARAM;
  }

  ctx->baud_rate = baud_rate;

  return I2_SUCCESS;
}

/************************ (C) COPYRIGHT iota2 ***[i2]*****END OF FILE**********/
